ATsupportum/src/InformationRegisters/НастройкиОтправителя/НастройкиОтправителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтправителя</name>
  <comment>Используется для  хранения связей каналов с получателями этих каналов. Регистр задает рассылку по получателям со стороны отправителя.</comment>
  <dimensions>
    <name>КаналСообщений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.ОбменСообщениями</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/НастройкиОтправителя/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Определяет конечные точки, для которых в текущей информационной системе 
// назначен заданный канал сообщений.
//
// Параметры:
//  КаналСообщений – Строка. Идентификатор адресного канала сообщений.
//
// Возвращаемое значение:
//  Тип: Массив. Массив элементов конечных точек.
//  Массив содержит элементы типа ПланОбменаСсылка.ОбменСообщениями.
//
Функция ПодписчикиКаналаСообщений(Знач КаналСообщений) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиОтправителя.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.НастройкиОтправителя КАК НастройкиОтправителя
	|ГДЕ
	|	НастройкиОтправителя.КаналСообщений = &КаналСообщений";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КаналСообщений", КаналСообщений);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
КонецФункции

#КонецЕсли
